{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "trainable": true, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 49, 224, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-29-7d6770b6c2c6>\u00da\b<lambda>\u0007\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "b_constraint": null, "nb_col": 5, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_1", "subsample": [1, 1], "nb_row": 5, "dim_ordering": "tf", "nb_filter": 24, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "b_constraint": null, "nb_col": 5, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "nb_row": 5, "dim_ordering": "tf", "nb_filter": 36, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "b_constraint": null, "nb_col": 5, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_3", "subsample": [1, 1], "nb_row": 5, "dim_ordering": "tf", "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "b_constraint": null, "nb_col": 3, "activation": "relu", "activity_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 1164, "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 2688}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 512, "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 1164}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 50, "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_3", "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 512}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 10, "trainable": true, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_4", "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 50}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "b_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_5", "init": "glorot_uniform", "bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": 10}}]}